#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.mongodb_atlas_producer.akeyless_role.k8s-access-role: Refreshing state... [id=/terraform-db/Team1]
module.mongodb_atlas_producer.akeyless_producer_mongo.mongo_producer: Refreshing state... [id=/Azure MongoDB Atlas - Sample Analytics]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.mongodb_atlas_producer.akeyless_producer_mongo.mongo_producer has changed
  ~ resource "akeyless_producer_mongo" "mongo_producer" {
        id                           = "/Azure MongoDB Atlas - Sample Analytics"
        name                         = "/Azure MongoDB Atlas - Sample Analytics"
      + producer_encryption_key_name = "/myKey"
      ~ target_name                  = "/Azure Atlas" -> "Azure Atlas"
        # (4 unchanged attributes hidden)
    }

  # module.mongodb_atlas_producer.akeyless_role.k8s-access-role has changed
  ~ resource "akeyless_role" "k8s-access-role" {
      + assoc_auth_method_with_rules = jsonencode(
            {
              + client_permissions      = [
                  + "read",
                  + "list",
                  + "update",
                  + "delete",
                  + "create",
                ]
              + comment                 = ""
              + role_auth_methods_assoc = [
                  + {
                      + assoc_id                  = "ass-ulaowshar3oqt6b62v8d"
                      + auth_method_access_id     = "p-oki4w02qfz9c"
                      + auth_method_name          = "my-k8s-auth-method"
                      + auth_method_sub_claims    = {
                          + namespace = [
                              + "team1",
                            ]
                        }
                      + sub_claims_case_sensitive = true
                    },
                  + {
                      + assoc_id                  = "ass-wbashdszp6fjq6q2i642"
                      + auth_method_access_id     = "p-jgk2szbi1vwd"
                      + auth_method_name          = "OktaSAML"
                      + auth_method_sub_claims    = {
                          + groups = [
                              + "Team1",
                            ]
                        }
                      + sub_claims_case_sensitive = true
                    },
                ]
              + role_name               = "terraform-db/Team1"
              + rules                   = {
                  + admin      = false
                  + path_rules = [
                      + {
                          + capabilities = [
                              + "deny",
                            ]
                          + path         = "/Prod/*"
                          + type         = "item-rule"
                        },
                      + {
                          + capabilities = [
                              + "read",
                              + "list",
                            ]
                          + path         = "/Azure MongoDB Atlas - Sample Analytics"
                          + type         = "item-rule"
                        },
                      + {
                          + capabilities = [
                              + "read",
                              + "list",
                            ]
                          + path         = "/k8s/*"
                          + type         = "item-rule"
                        },
                    ]
                }
            }
        )
        id                           = "/terraform-db/Team1"
        name                         = "/terraform-db/Team1"
        # (2 unchanged attributes hidden)


        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.mongodb_atlas_producer.akeyless_producer_mongo.mongo_producer will be updated in-place
  ~ resource "akeyless_producer_mongo" "mongo_producer" {
        id                           = "/Azure MongoDB Atlas - Sample Analytics"
        name                         = "/Azure MongoDB Atlas - Sample Analytics"
      - producer_encryption_key_name = "/myKey" -> null
      ~ target_name                  = "Azure Atlas" -> "/Azure Atlas"
        # (4 unchanged attributes hidden)
    }

  # module.mongodb_atlas_producer2.akeyless_producer_mongo.mongo_producer will be created
  + resource "akeyless_producer_mongo" "mongo_producer" {
      + id                      = (known after apply)
      + mongodb_default_auth_db = "admin"
      + mongodb_roles           = jsonencode(
            [
              + {
                  + databaseName = "sample_restaurants"
                  + roleName     = "readWrite"
                },
            ]
        )
      + name                    = "/Azure MongoDB Atlas - Sample Restaurants"
      + secure_access_db_name   = (known after apply)
      + secure_access_web       = false
      + target_name             = "/Azure Atlas"
      + user_ttl                = "8h"
    }

  # module.mongodb_atlas_producer2.akeyless_role.k8s-access-role will be created
  + resource "akeyless_role" "k8s-access-role" {
      + analytics_access             = "none"
      + assoc_auth_method_with_rules = (known after apply)
      + audit_access                 = "none"
      + id                           = (known after apply)
      + name                         = "/terraform-db/Team2"

      + assoc_auth_method {
          + am_name    = "/OktaSAML"
          + sub_claims = {
              + "groups" = "Team2"
            }
        }
      + assoc_auth_method {
          + am_name    = "/my-k8s-auth-method"
          + sub_claims = {
              + "namespace" = "team2"
            }
        }

      + rules {
          + capability = [
              + "list",
              + "read",
            ]
          + path       = "/Azure MongoDB Atlas - Sample Restaurants"
          + rule_type  = "item-rule"
        }
      + rules {
          + capability = [
              + "list",
              + "read",
            ]
          + path       = "/k8s/*"
          + rule_type  = "item-rule"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @devorbitus, Action: `pull_request`, Working Directory: ``, Workflow: `Secrets`*